*** crates/soldier_core/src/execution/dispatch_map.rs:103:41: replace += with -= in MismatchMetrics::record_mismatch_rejection

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace += with -= in MismatchMetrics::record_mismatch_rejection
@@ -95,17 +95,17 @@
     pub fn new() -> Self {
         Self {
             reject_unit_mismatch_total: 0,
         }
     }
 
     /// Increment the mismatch rejection counter.
     pub fn record_mismatch_rejection(&mut self) {
-        self.reject_unit_mismatch_total += 1;
+        self.reject_unit_mismatch_total -= /* ~ changed by cargo-mutants ~ */ 1;
     }
 
     /// Current value of `order_intent_reject_unit_mismatch_total`.
     pub fn reject_unit_mismatch_total(&self) -> u64 {
         self.reject_unit_mismatch_total
     }
 }

---- test_at920_delta_in_error stdout ----

thread 'test_at920_delta_in_error' (10256929) panicked at crates/soldier_core/src/execution/dispatch_map.rs:103:9:
attempt to subtract with overflow

---- test_at920_inf_canonical_amount_rejected_with_infinity_delta stdout ----

thread 'test_at920_inf_canonical_amount_rejected_with_infinity_delta' (10256931) panicked at crates/soldier_core/src/execution/dispatch_map.rs:103:9:
attempt to subtract with overflow

---- test_at920_mismatch_caller_sets_degraded_and_blocks_open stdout ----

thread 'test_at920_mismatch_caller_sets_degraded_and_blocks_open' (10256932) panicked at crates/soldier_core/src/execution/dispatch_map.rs:103:9:
attempt to subtract with overflow

failures:
    test_at920_delta_in_error
    test_at920_inf_canonical_amount_rejected_with_infinity_delta
    test_at920_mismatch_caller_sets_degraded_and_blocks_open
    test_at920_mismatch_increments_counter
    test_at920_mismatch_rejected
    test_at920_nan_canonical_amount_rejected_with_infinity_delta
    test_at920_no_dispatch_on_mismatch
    test_at920_non_finite_multiplier_rejected
    test_at920_perpetual_mismatch_rejected

test result: FAILED. 21 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
