*** crates/soldier_core/src/execution/dispatch_map.rs:103:9: replace MismatchMetrics::record_mismatch_rejection with ()

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace MismatchMetrics::record_mismatch_rejection with ()
@@ -95,17 +95,17 @@
     pub fn new() -> Self {
         Self {
             reject_unit_mismatch_total: 0,
         }
     }
 
     /// Increment the mismatch rejection counter.
     pub fn record_mismatch_rejection(&mut self) {
-        self.reject_unit_mismatch_total += 1;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Current value of `order_intent_reject_unit_mismatch_total`.
     pub fn reject_unit_mismatch_total(&self) -> u64 {
         self.reject_unit_mismatch_total
     }
 }

---- test_at920_inf_canonical_amount_rejected_with_infinity_delta stdout ----

thread 'test_at920_inf_canonical_amount_rejected_with_infinity_delta' (10253435) panicked at crates/soldier_core/tests/test_dispatch_map.rs:541:5:
assertion `left == right` failed
  left: 0
 right: 1

---- test_at920_mismatch_caller_sets_degraded_and_blocks_open stdout ----

thread 'test_at920_mismatch_caller_sets_degraded_and_blocks_open' (10253436) panicked at crates/soldier_core/tests/test_dispatch_map.rs:699:5:
assertion `left == right` failed: mismatch counter must increment
  left: 0
 right: 1

---- test_at920_mismatch_increments_counter stdout ----

thread 'test_at920_mismatch_increments_counter' (10253437) panicked at crates/soldier_core/tests/test_dispatch_map.rs:359:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    test_at920_inf_canonical_amount_rejected_with_infinity_delta
    test_at920_mismatch_caller_sets_degraded_and_blocks_open
    test_at920_mismatch_increments_counter
    test_at920_nan_canonical_amount_rejected_with_infinity_delta
    test_at920_non_finite_multiplier_rejected
    test_at920_perpetual_mismatch_rejected

test result: FAILED. 24 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
