*** crates/soldier_core/src/execution/dispatch_map.rs:108:9: replace MismatchMetrics::reject_unit_mismatch_total -> u64 with 1

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace MismatchMetrics::reject_unit_mismatch_total -> u64 with 1
@@ -100,17 +100,17 @@
 
     /// Increment the mismatch rejection counter.
     pub fn record_mismatch_rejection(&mut self) {
         self.reject_unit_mismatch_total += 1;
     }
 
     /// Current value of `order_intent_reject_unit_mismatch_total`.
     pub fn reject_unit_mismatch_total(&self) -> u64 {
-        self.reject_unit_mismatch_total
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl Default for MismatchMetrics {
     fn default() -> Self {
         Self::new()
     }
 }

---- test_at920_consistent_contracts_passes stdout ----

thread 'test_at920_consistent_contracts_passes' (10267498) panicked at crates/soldier_core/tests/test_dispatch_map.rs:308:5:
assertion `left == right` failed
  left: 1
 right: 0

---- test_at920_epsilon_denominator_allows_small_amount_within_tolerance stdout ----

thread 'test_at920_epsilon_denominator_allows_small_amount_within_tolerance' (10267500) panicked at crates/soldier_core/tests/test_dispatch_map.rs:438:5:
assertion `left == right` failed
  left: 1
 right: 0

---- test_at920_mismatch_increments_counter stdout ----

thread 'test_at920_mismatch_increments_counter' (10267503) panicked at crates/soldier_core/tests/test_dispatch_map.rs:350:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    test_at920_consistent_contracts_passes
    test_at920_epsilon_denominator_allows_small_amount_within_tolerance
    test_at920_mismatch_increments_counter
    test_at920_no_contracts_skips_check
    test_at920_no_multiplier_rejected_fail_closed
    test_at920_within_tolerance_passes

test result: FAILED. 24 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
