*** crates/soldier_core/src/execution/dispatch_map.rs:199:42: replace || with && in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace || with && in validate_and_dispatch
@@ -191,17 +191,17 @@
                 .qty_coin
                 .ok_or(DispatchMapError::MissingQtyCoin)?,
             InstrumentKind::Perpetual | InstrumentKind::InverseFuture => {
                 order_size.qty_usd.ok_or(DispatchMapError::MissingQtyUsd)?
             }
         };
 
         // Fail closed on invalid numeric inputs to avoid NaN/Inf bypasses.
-        if !canonical_amount.is_finite() || !multiplier.is_finite() {
+        if !canonical_amount.is_finite() && /* ~ changed by cargo-mutants ~ */ !multiplier.is_finite() {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch {
                 delta: f64::INFINITY,
             });
         }
 
         let contracts_implied = contracts as f64 * multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);

---- test_at920_inf_canonical_amount_rejected_with_infinity_delta stdout ----

thread 'test_at920_inf_canonical_amount_rejected_with_infinity_delta' (10271041) panicked at crates/soldier_core/tests/test_dispatch_map.rs:534:13:
Inf canonical amount must produce delta = INFINITY (early guard), got NaN

---- test_at920_nan_canonical_amount_rejected_with_infinity_delta stdout ----

thread 'test_at920_nan_canonical_amount_rejected_with_infinity_delta' (10271045) panicked at crates/soldier_core/tests/test_dispatch_map.rs:503:13:
NaN canonical amount must produce delta = INFINITY (early guard), got NaN

---- test_at920_non_finite_multiplier_rejected stdout ----

thread 'test_at920_non_finite_multiplier_rejected' (10271049) panicked at crates/soldier_core/tests/test_dispatch_map.rs:466:13:
NaN multiplier must produce delta = INFINITY (early guard), got NaN

failures:
    test_at920_inf_canonical_amount_rejected_with_infinity_delta
    test_at920_nan_canonical_amount_rejected_with_infinity_delta
    test_at920_non_finite_multiplier_rejected

test result: FAILED. 27 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
