*** crates/soldier_core/src/execution/dispatch_map.rs:199:45: delete ! in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ delete ! in validate_and_dispatch
@@ -191,17 +191,17 @@
                 .qty_coin
                 .ok_or(DispatchMapError::MissingQtyCoin)?,
             InstrumentKind::Perpetual | InstrumentKind::InverseFuture => {
                 order_size.qty_usd.ok_or(DispatchMapError::MissingQtyUsd)?
             }
         };
 
         // Fail closed on invalid numeric inputs to avoid NaN/Inf bypasses.
-        if !canonical_amount.is_finite() || !multiplier.is_finite() {
+        if !canonical_amount.is_finite() ||  /* ~ changed by cargo-mutants ~ */multiplier.is_finite() {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch {
                 delta: f64::INFINITY,
             });
         }
 
         let contracts_implied = contracts as f64 * multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);

---- test_at920_consistent_contracts_passes stdout ----

thread 'test_at920_consistent_contracts_passes' (10278288) panicked at crates/soldier_core/tests/test_dispatch_map.rs:305:28:
called `Result::unwrap()` on an `Err` value: ContractsAmountMismatch { delta: inf }

---- test_at920_delta_in_error stdout ----

thread 'test_at920_delta_in_error' (10278289) panicked at crates/soldier_core/tests/test_dispatch_map.rs:618:13:
delta should be ~0.6667, got inf

---- test_at920_epsilon_denominator_allows_small_amount_within_tolerance stdout ----

thread 'test_at920_epsilon_denominator_allows_small_amount_within_tolerance' (10278290) panicked at crates/soldier_core/tests/test_dispatch_map.rs:437:5:
delta at tolerance boundary should pass

failures:
    test_at920_consistent_contracts_passes
    test_at920_delta_in_error
    test_at920_epsilon_denominator_allows_small_amount_within_tolerance
    test_at920_non_finite_multiplier_rejected
    test_at920_within_tolerance_passes

test result: FAILED. 25 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
