*** crates/soldier_core/src/execution/dispatch_map.rs:206:50: replace * with + in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace * with + in validate_and_dispatch
@@ -198,17 +198,17 @@
         // Fail closed on invalid numeric inputs to avoid NaN/Inf bypasses.
         if !canonical_amount.is_finite() || !multiplier.is_finite() {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch {
                 delta: f64::INFINITY,
             });
         }
 
-        let contracts_implied = contracts as f64 * multiplier;
+        let contracts_implied = contracts as f64 + /* ~ changed by cargo-mutants ~ */ multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);
         let delta = (contracts_implied - canonical_amount).abs() / denominator;
 
         if !contracts_implied.is_finite()
             || !delta.is_finite()
             || delta > CONTRACTS_AMOUNT_MATCH_TOLERANCE
         {
             metrics.record_mismatch_rejection();

---- test_at920_mismatch_caller_sets_degraded_and_blocks_open stdout ----

thread 'test_at920_mismatch_caller_sets_degraded_and_blocks_open' (10281915) panicked at crates/soldier_core/tests/test_dispatch_map.rs:692:5:
expected ContractsAmountMismatch, got Ok(ValidatedDispatch { request: DispatchRequest { amount: 1.0, reduce_only: false }, risk_state: Healthy })

---- test_at920_consistent_contracts_passes stdout ----

thread 'test_at920_consistent_contracts_passes' (10281911) panicked at crates/soldier_core/tests/test_dispatch_map.rs:305:28:
called `Result::unwrap()` on an `Err` value: ContractsAmountMismatch { delta: 0.3333333333333333 }

---- test_at920_delta_in_error stdout ----

thread 'test_at920_delta_in_error' (10281912) panicked at crates/soldier_core/tests/test_dispatch_map.rs:618:13:
delta should be ~0.6667, got 1

failures:
    test_at920_consistent_contracts_passes
    test_at920_delta_in_error
    test_at920_mismatch_caller_sets_degraded_and_blocks_open
    test_at920_within_tolerance_passes

test result: FAILED. 26 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
