*** crates/soldier_core/src/execution/dispatch_map.rs:208:40: replace - with + in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace - with + in validate_and_dispatch
@@ -200,17 +200,17 @@
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch {
                 delta: f64::INFINITY,
             });
         }
 
         let contracts_implied = contracts as f64 * multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);
-        let delta = (contracts_implied - canonical_amount).abs() / denominator;
+        let delta = (contracts_implied + /* ~ changed by cargo-mutants ~ */ canonical_amount).abs() / denominator;
 
         if !contracts_implied.is_finite()
             || !delta.is_finite()
             || delta > CONTRACTS_AMOUNT_MATCH_TOLERANCE
         {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch { delta });
         }

---- test_at920_consistent_contracts_passes stdout ----

thread 'test_at920_consistent_contracts_passes' (10296284) panicked at crates/soldier_core/tests/test_dispatch_map.rs:305:28:
called `Result::unwrap()` on an `Err` value: ContractsAmountMismatch { delta: 2.0 }

---- test_at920_delta_in_error stdout ----

thread 'test_at920_delta_in_error' (10296285) panicked at crates/soldier_core/tests/test_dispatch_map.rs:618:13:
delta should be ~0.6667, got 2.6666666666666665

---- test_at920_within_tolerance_passes stdout ----

thread 'test_at920_within_tolerance_passes' (10296298) panicked at crates/soldier_core/tests/test_dispatch_map.rs:592:5:
assertion failed: result.is_ok()

failures:
    test_at920_consistent_contracts_passes
    test_at920_delta_in_error
    test_at920_within_tolerance_passes

test result: FAILED. 27 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
