*** crates/soldier_core/src/execution/dispatch_map.rs:208:66: replace / with % in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace / with % in validate_and_dispatch
@@ -200,17 +200,17 @@
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch {
                 delta: f64::INFINITY,
             });
         }
 
         let contracts_implied = contracts as f64 * multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);
-        let delta = (contracts_implied - canonical_amount).abs() / denominator;
+        let delta = (contracts_implied - canonical_amount).abs() % /* ~ changed by cargo-mutants ~ */ denominator;
 
         if !contracts_implied.is_finite()
             || !delta.is_finite()
             || delta > CONTRACTS_AMOUNT_MATCH_TOLERANCE
         {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch { delta });
         }

---- test_at920_delta_in_error stdout ----

thread 'test_at920_delta_in_error' (10289137) panicked at crates/soldier_core/tests/test_dispatch_map.rs:618:13:
delta should be ~0.6667, got 2

---- test_at920_mismatch_increments_counter stdout ----

thread 'test_at920_mismatch_increments_counter' (10289141) panicked at crates/soldier_core/tests/test_dispatch_map.rs:359:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    test_at920_delta_in_error
    test_at920_mismatch_increments_counter

test result: FAILED. 28 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
