*** crates/soldier_core/src/execution/dispatch_map.rs:211:16: delete ! in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ delete ! in validate_and_dispatch
@@ -203,17 +203,17 @@
             });
         }
 
         let contracts_implied = contracts as f64 * multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);
         let delta = (contracts_implied - canonical_amount).abs() / denominator;
 
         if !contracts_implied.is_finite()
-            || !delta.is_finite()
+            ||  /* ~ changed by cargo-mutants ~ */delta.is_finite()
             || delta > CONTRACTS_AMOUNT_MATCH_TOLERANCE
         {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch { delta });
         }
     }
 
     let request = map_to_dispatch_unchecked(order_size, instrument_kind, intent)?;

---- test_at920_epsilon_denominator_allows_small_amount_within_tolerance stdout ----

thread 'test_at920_epsilon_denominator_allows_small_amount_within_tolerance' (10314744) panicked at crates/soldier_core/tests/test_dispatch_map.rs:437:5:
delta at tolerance boundary should pass

---- test_at920_consistent_contracts_passes stdout ----

thread 'test_at920_consistent_contracts_passes' (10314742) panicked at crates/soldier_core/tests/test_dispatch_map.rs:305:28:
called `Result::unwrap()` on an `Err` value: ContractsAmountMismatch { delta: 0.0 }

---- test_at920_within_tolerance_passes stdout ----

thread 'test_at920_within_tolerance_passes' (10314756) panicked at crates/soldier_core/tests/test_dispatch_map.rs:592:5:
assertion failed: result.is_ok()

failures:
    test_at920_consistent_contracts_passes
    test_at920_epsilon_denominator_allows_small_amount_within_tolerance
    test_at920_within_tolerance_passes

test result: FAILED. 27 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
