*** crates/soldier_core/src/execution/dispatch_map.rs:212:22: replace > with < in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace > with < in validate_and_dispatch
@@ -204,17 +204,17 @@
         }
 
         let contracts_implied = contracts as f64 * multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);
         let delta = (contracts_implied - canonical_amount).abs() / denominator;
 
         if !contracts_implied.is_finite()
             || !delta.is_finite()
-            || delta > CONTRACTS_AMOUNT_MATCH_TOLERANCE
+            || delta < /* ~ changed by cargo-mutants ~ */ CONTRACTS_AMOUNT_MATCH_TOLERANCE
         {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch { delta });
         }
     }
 
     let request = map_to_dispatch_unchecked(order_size, instrument_kind, intent)?;
     Ok(ValidatedDispatch {

---- test_at920_delta_in_error stdout ----

thread 'test_at920_delta_in_error' (10321791) panicked at crates/soldier_core/tests/test_dispatch_map.rs:623:18:
expected ContractsAmountMismatch, got Ok(ValidatedDispatch { request: DispatchRequest { amount: 3.0, reduce_only: false }, risk_state: Healthy })

---- test_at920_consistent_contracts_passes stdout ----

thread 'test_at920_consistent_contracts_passes' (10321790) panicked at crates/soldier_core/tests/test_dispatch_map.rs:305:28:
called `Result::unwrap()` on an `Err` value: ContractsAmountMismatch { delta: 0.0 }

---- test_at920_mismatch_caller_sets_degraded_and_blocks_open stdout ----

thread 'test_at920_mismatch_caller_sets_degraded_and_blocks_open' (10321794) panicked at crates/soldier_core/tests/test_dispatch_map.rs:692:5:
expected ContractsAmountMismatch, got Ok(ValidatedDispatch { request: DispatchRequest { amount: 1.0, reduce_only: false }, risk_state: Healthy })

failures:
    test_at920_consistent_contracts_passes
    test_at920_delta_in_error
    test_at920_mismatch_caller_sets_degraded_and_blocks_open
    test_at920_mismatch_increments_counter
    test_at920_mismatch_rejected
    test_at920_no_dispatch_on_mismatch
    test_at920_perpetual_mismatch_rejected
    test_at920_within_tolerance_passes

test result: FAILED. 22 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
