*** crates/soldier_core/src/execution/dispatch_map.rs:212:22: replace > with >= in validate_and_dispatch

*** mutation diff:
--- crates/soldier_core/src/execution/dispatch_map.rs
+++ replace > with >= in validate_and_dispatch
@@ -204,17 +204,17 @@
         }
 
         let contracts_implied = contracts as f64 * multiplier;
         let denominator = canonical_amount.abs().max(CONTRACTS_AMOUNT_MATCH_EPSILON);
         let delta = (contracts_implied - canonical_amount).abs() / denominator;
 
         if !contracts_implied.is_finite()
             || !delta.is_finite()
-            || delta > CONTRACTS_AMOUNT_MATCH_TOLERANCE
+            || delta >= /* ~ changed by cargo-mutants ~ */ CONTRACTS_AMOUNT_MATCH_TOLERANCE
         {
             metrics.record_mismatch_rejection();
             return Err(DispatchMapError::ContractsAmountMismatch { delta });
         }
     }
 
     let request = map_to_dispatch_unchecked(order_size, instrument_kind, intent)?;
     Ok(ValidatedDispatch {

---- test_at920_epsilon_denominator_allows_small_amount_within_tolerance stdout ----

thread 'test_at920_epsilon_denominator_allows_small_amount_within_tolerance' (10325399) panicked at crates/soldier_core/tests/test_dispatch_map.rs:437:5:
delta at tolerance boundary should pass

failures:
    test_at920_epsilon_denominator_allows_small_amount_within_tolerance

test result: FAILED. 29 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
